// Домашняя работа по семинару 1. 

// Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
/*
Console.Write("Input number1: ");
int number1 = Convert.ToInt32(Console.ReadLine());
Console.Write("Input number2: ");
int number2 = Convert.ToInt32(Console.ReadLine());

if(number1 > number2)
{
    Console.WriteLine("Number1 > Number2");
}
else
{
    Console.WriteLine("Number2 > Number1");
}
*/

// Задача 2.

// Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
/*
Console.Write("Input number1: ");
int number1 = Convert.ToInt32(Console.ReadLine());
Console.Write("Input number2: ");
int number2 = Convert.ToInt32(Console.ReadLine());
Console.Write("Input number3: ");
int number3 = Convert.ToInt32(Console.ReadLine());

int max = number1;

if (number2 > max)
{
    Console.WriteLine("number2");
}
else
{
    Console.WriteLine("number1");
}

if (number3 > max)
{
    Console.WriteLine("number3");
}
*/

// Задача 3.

// Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).
/*
Console.Write("Input number: ");
int number = Convert.ToInt32(Console.ReadLine());

if (number % 2 == 0)
{
    Console.WriteLine("Chetnoe");
}
else
{
    Console.WriteLine("Nechetnoe");
}
*/

// Задача 4.

// Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.
/*
Console.Write("Input number: ");
int number = Convert.ToInt32(Console.ReadLine());

int current = 2;

if (number > 1 )
{
   while (current <= number)
   {
    Console.Write(current + " ");
    current = current + 2;
   }
}
*/
